---
kind: method
id: M:Autodesk.Revit.DB.Definitions.Contains(Autodesk.Revit.DB.Definition)
source: html/c6067423-d993-c166-22bc-ee4b55202b22.htm
---
# Autodesk.Revit.DB.Definitions.Contains Method

Tests for the existence of a definition within the set.

## Syntax (C#)
```csharp
public bool Contains(
	Definition definition
)
```

## Parameters
- **definition** (`Autodesk.Revit.DB.Definition`) - The definition to look for.

## Returns
True if the definition was found, false otherwise.